{"1":{
	"_id" : ObjectId("5a26d24428e5fdd9dd7638c9"),
	"title" : "Russian Sausages",
	"author" : "2",
	"prl" : "",
	"desc" : "I made this for my son.",
	"step" : "Grind meats with 3/8” (10 mm) plate. Cut back fat manually into ⅛“ (3 mm) cubes. Mix all ingredients with meat adding wine. Mix until all wine is absorbed by the mixture. Then add diced fat and mix everything together. Stuff into beef middles or fibrous synthetic casings 40 - 60 mm and form 12” (30 cm) long links. Hang at room temperature for 1-2 hours. Apply hot smoke for 110-130 min until casings develop brown color with a red tint. In the last stage of smoking the sausage is baked at 167-194º F (75-90º C) until internal meat temperature is 68-70º C (154-158º F). Shower with cold water for about 5 min, then lower sausage temperature to below 12º C (53º F). Store in refrigerator.",
	"region" : "Russia",
	"ming" : "sausage",
	"ing" : "salt 18g, cure 2.5g, pepper 2g, sugar 2g, cardamon 2g, allspice 2g, madeira wine 60ml",
	"kind" : "meal",
	"works" : [ ],
	"ts" : ISODate("2017-12-05T12:07:12.297Z"),
	"rate" : 0,
	"ppl" : 1
},
"2":{
	"_id" : ObjectId("5a26d41028e5fdd9dd7638ca"),
	"title" : "Citrus_Shortbread_Cookies",
	"author" : "2",
	"prl" : "",
	"desc" : "This recipe was given to me by my mother-in-law, one of the best cooks I know...and given that we're from south Louisiana, that's saying something. With the chopped up dried cranberries, these are as pretty as they are tasty.",
	"ing" : "3/4 cup butter or margarine, softened 1/4 cup granulated sugar 2 cups Gold Medal™ all-purpose flour 1 1/2 teaspoons grated lime peel 1 1/2 teaspoons grated orange peel 1 cup powdered sugar 1 to 2 tablespoons lime juice",
	"step" : "Heat oven to 350°F. In large bowl, beat butter and granulated sugar with electric mixer on medium speed 2 to 3 minutes or until light and creamy. Add flour, lime peel and orange peel. Beat on low speed until mixture is blended. Gather dough into a ball. On lightly floured surface, roll dough into 8x6-inch rectangle, about 1/2 inch thick. (If dough cracks around edges, press edges to smooth.) Cut into 12 (2-inch) squares, then cut each square diagonally in half into triangles. On ungreased cookie sheet, place triangles 1/2 inch apart. Bake 12 to 17 minutes or until edges just begin to brown. Cool 1 minute; remove from cookie sheet to wire rack. Cool completely, about 15 minutes. In small bowl, mix powdered sugar and lime juice with spoon until smooth and thin enough to drizzle. Drizzle glaze over cookies.",
	"region" : "All",
	"ming" : "butter",
	"kind" : "dessert",
	"works" : [ ],
	"ts" : ISODate("2017-12-05T12:14:50.334Z"),
	"rate" : 0,
	"ppl" : 1
},
"3":{
	"_id" : ObjectId("5a26de9a28e5fdd9dd7638cb"),
	"title" : "Chocolate Caramel Brownie",
	"author" : "2",
	"prl" : "",
	"desc" : "Chocolate cake mix, evaporated milk and caramels make these the most moist and tender brownies this side of paradise. Add chocolate chips and chopped nuts and you'll think you've already arrived!",
	"step" : "PREHEAT oven to 350° F. COMBINE cake mix and nuts in large bowl. Stir in 2/3 cup evaporated milk and butter (batter will be thick). Spread half of batter into ungreased 13 x 9-inch baking pan. BAKE for 15 minutes. \nHEAT caramels and remaining evaporated milk in small saucepan over low heat, stirring constantly, until caramels are melted. Sprinkle morsels over brownie; drizzle with caramel mixture.\n DROP remaining batter by heaping teaspoon over caramel mixture. \n BAKE for 25 to 30 minutes or until center is set. Cool in pan on wire rack. Cut into 24 squares.",
	"region" : "All",
	"ing" : "1 pkg. (18.25 oz.) chocolate cake mix, 1 cup chopped nuts, 1 cup NESTLÉ® CARNATION® Evaporated Milk, divided ,1/2 cup (1 stick) butter or margarine, melted 35 (10-oz. pkg.) caramels, unwrapped 2 cups (12-oz. pkg.) NESTLÉ® TOLL HOUSE® Semi-Sweet Chocolate Morsels",
	"kind" : "dessert",
	"works" : [ ],
	"ts" : ISODate("2017-12-05T12:59:45.241Z"),
	"rate" : 0,
	"ppl" : 1,
	"ming" : "chocolate"
},
"4":{
	"_id" : ObjectId("5a27156128e5fdd9dd7638cc"),
	"title" : "Rice Roll",
	"author" : "2",
	"prl" : "",
	"desc" : "Recipe from my hometown.",
	"step" : "Mix all the ingredients for the batter. Stir until it is well-mixed and no lumps. Prepare a steamer (big enough to harbour an 8 inches tray). Prepare 2 of the 8 inches trays. Brush with some oil or use cooking spray. Laddle about 1/4 cup (25 ml) of the flour mixture onto the tray and swirl around to cover the entire tray. It helps to actually put the tray in the steamer first and then ladle the batter and swirl, it covers the surface much better. Cover with lid for 2-3 minutes, my mom said she 4-5 minutes worked for her. The flour mixture will turn white and slightly transclucent. Make sure the heat is high enough. If it’s not hot enough, the flour mixture will not congeal and it will taste starchy. Repeat this process with another tray and while another one is steaming, you can roll this one that is ready. Use a rubber spatula to scrape off any batter that gets stuck to the pan and then oil the pan again and continue with the process. Make sure you stir the flour mixture EVERY TIME before you laddle it to the tray. The flour mixture tends to settle at the bottom after a while. Garnish with sesame seeds fried shallot crisp and douse with the sauce",
	"region" : "China",
	"ing" : "1 cup rice flour, 1 Tbsp corn starch, 1/4 tsp salt, 1 Tbsp cooking oil, 2 stalks of spring onion finely chopped, 2 cups water, 1 cup soy sauce, 3-4 Tbsp sugar adjust accordingly to your taste, 1 Tbsp sesame oil",
	"kind" : "meal",
	"works" : [ ],
	"ts" : ISODate("2017-12-05T16:53:34.173Z"),
	"rate" : 0,
	"ppl" : 1,
	"ming" : "rice"
},
"5":{
	"_id" : ObjectId("5a271c5928e5fdd9dd7638cd"),
	"title" : "Poutine",
	"author" : "2",
	"prl" : "",
	"desc" : "One of a kind of Canadian cuisines.",
	"step" : "Heat oil in a deep fryer or deep heavy skillet to 365°F (185°C). Warm gravy in saucepan or microwave. Place the fries into the hot oil, and cook until light brown, about 5 minutes. Remove to a paper towel lined plate to drain. Place the fries on a serving platter, and sprinkle the cheese over them. Ladle gravy over the fries and cheese, and serve immediately.",
	"region" : "Canada",
	"ing" : "1 quart vegetable oil (for frying), 1 (10 1/4 ounce) can beef gravy, 5 medium potatoes, cut into fries, 2 cups cheese curds",
	"kind" : "meal",
	"works" : [ ],
	"ts" : ISODate("2017-12-05T17:23:17.284Z"),
	"rate" : 0,
	"ppl" : 1,
	"ming" : "potato"
},
"6":{
	"_id" : ObjectId("5a271f0c28e5fdd9dd7638ce"),
	"title" : "Niku Udon",
	"author" : "2",
	"prl" : "",
	"desc" : "Great work from Nami Chen.",
	"step" : "Gather all the ingredients. In a small saucepan, add 2 cups (480 ml) dashi and 1 tsp. sugar. Add 1 Tbsp. mirin and 1 Tbsp. soy sauce and bring it to a boil. Taste the soup and adjust the taste with Kosher salt as it will enhance the flavor without adding additional sugar or soy sauce. Cover and keep it on low heat. Cut the Tokyo negi (or use sub) and Narutomaki (fish cake) diagonally. Cut the Mitsuba (optional) into small pieces and thinly slice one onion/scallion (used for topping). Cut the thinly sliced meat into bite size pieces. Bring a big pot of water to a boil. Once boiling, cook the frozen udon for 1 minute. Loosen up the noodles once they started to separate. Once the udon is done cooking, use fine sieve to drain water and transfer to serving bowls. While cooking udon, you can start heating the large frying pan. Once it’s heated, add 1 Tbsp. vegetable oil and cook the Tokyo negi until tender. Add the meat and brown all sides. Don’t move the meat around until it’s nicely seared. Once the meat is nicely browned, add ½ to 1 Tbsp. sugar and 1 Tbsp. soy sauce. When the sauce has caramelized and slightly thicken, turn off the heat. By this time, the noodle should be in the serving bowls. Pour the hot soup over the udon noodles in the bowls. Then serve the meat on top of the udon noodles. Place the narutomaki (fish cake) and garnish with scallion and mitsuba. If you like it spicy, sprinkle Shichimi Togarashi (Japanese 7 spice). Enjoy!",
	"region" : "Japan",
	"ing" : "1 Tbsp neutral flavor oil (vegetable, canola, etc) \n ½ Tokyo negi (sub: ½ leek or 2 scallions/green onions) \n ½ lb thinly sliced beef (chuck or rib eye) (½ = 227 g) (ribeye or top sirloin) \n 2 packages Udon noodles (I like frozen sanuki noodles) \n For Beef \n 1 Tbsp soy sauce \n ½-1 Tbsp granulated sugar \n For Soup \n 2 cups dashi (2 cups = 480 ml) \n 1 Tbsp soy sauce \n 1 Tbsp mirin \n 1 tsp granulated sugar \n pinch Kosher salt \n For Toppings \n Narutomaki (fish cakes) (few slices) \n 3 sprigs Mitsuba (Japanese parsley) (Optional) \n 1 green onion/scallion \n Shichimi Togarashi (Japanese seven spice) (for taste)",
	"kind" : "meal",
	"works" : [ ],
	"ts" : ISODate("2017-12-05T17:34:47.933Z"),
	"rate" : 0,
	"ppl" : 1,
	"ming" : "beef"
}}